# BuiltInFailures.CurtainWallFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures Class
BuiltInFailures Class Members See Also
---
Failures about CurtainWall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CurtainWallFailures
```

Visual Basic
---
```text
Public NotInheritable Class CurtainWallFailures
```

Visual C++
---
```text
public ref class CurtainWallFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CurtainWallFailures
# See Also
BuiltInFailures..::..CurtainWallFailures Members
Autodesk.Revit.DB Namespace